lixpaulian/efr32xx-rail/platform/emlib/inc/em_ebi.h
/** TFT Data Increment Width */
typedef enum {
  /** Pixel increments are 1 byte at a time */
  ebiTFTWidthByte = EBI_TFTCTRL_WIDTH_BYTE,
  /** Pixel increments are 2 bytes (half word) */
  ebiTFTWidthHalfWord = EBI_TFTCTRL_WIDTH_HALFWORD,
} EBI_TFTWidth_TypeDef;

#endif // _EBI_TFTCTRL_MASK

/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/** EBI Initialization structure */
typedef struct {
  /** EBI operation mode, data and address limits */
  EBI_Mode_TypeDef     mode;
  /** Address Ready pin polarity, active high or low */
  EBI_Polarity_TypeDef ardyPolarity;
  /** Address Latch Enable pin polarity, active high or low */
  EBI_Polarity_TypeDef alePolarity;
  /** Write Enable pin polarity, active high or low */
  EBI_Polarity_TypeDef wePolarity;
  /** Read Enable pin polarity, active high or low */
  EBI_Polarity_TypeDef rePolarity;
  /** Chip Select pin polarity, active high or low */
  EBI_Polarity_TypeDef csPolarity;
#if !defined(_EFM32_GECKO_FAMILY)
  /** Byte Lane pin polarity, active high or low */
  EBI_Polarity_TypeDef blPolarity;
  /** Flag to enable or disable Byte Lane support */
  bool                 blEnable;
  /** Flag to enable or disable idle state insertion between transfers */
  bool                 noIdle;
#endif
  /** Flag to enable or disable Address Ready support */
  bool                 ardyEnable;
  /** Set to turn off 32 cycle timeout ability */
  bool                 ardyDisableTimeout;
  /** Mask of flags which selects address banks to configure EBI_BANK<0-3> */
  uint32_t             banks;
  /** Mask of flags which selects chip select lines to configure EBI_CS<0-3> */
  uint32_t             csLines;
  /** Number of cycles address is held after Adress Latch Enable is asserted */
  int                  addrSetupCycles;
  /** Number of cycles address is driven onto the ADDRDAT bus before ALE is asserted */
  int                  addrHoldCycles;
#if !defined(_EFM32_GECKO_FAMILY)
  /** Enable or disables half cycle duration of the ALE strobe in the last address setup cycle */
  bool                 addrHalfALE;
#endif
  /** Number of cycles for address setup before REn is asserted */
  int                  readSetupCycles;
  /** Number of cycles REn is held active */
  int                  readStrobeCycles;
  /** Number of cycles CSn is held active after REn is deasserted */
  int                  readHoldCycles;
#if !defined(_EFM32_GECKO_FAMILY)
  /** Enable or disable page mode reads */
  bool                 readPageMode;
  /** Enables or disable prefetching from sequential addresses */
  bool                 readPrefetch;
  /** Enabled or disables half cycle duration of the REn signal in the last strobe cycle  */
  bool                 readHalfRE;
#endif
  /** Number of cycles for address setup before WEn is asserted */
  int                  writeSetupCycles;
  /** Number of cycles WEn is held active */
  int                  writeStrobeCycles;
  /** Number of cycles CSn is held active after WEn is deasserted */
  int                  writeHoldCycles;
#if !defined(_EFM32_GECKO_FAMILY)
  /** Enable or disable the write buffer */
  bool                 writeBufferDisable;
  /** Enables or disables half cycle duration of the WEn signal in the last strobe cycle */
  bool                 writeHalfWE;
  /** Lower address pin limit to enable */
  EBI_ALow_TypeDef     aLow;
  /** High address pin limit to enable */
  EBI_AHigh_TypeDef    aHigh;
#endif
#if defined(_EBI_ROUTE_LOCATION_MASK)
  /** Pin Location */
  EBI_Location_TypeDef location;
#endif
  /** Flag, if EBI should be enabled after configuration */
  bool                 enable;
} EBI_Init_TypeDef;

/** Default config for EBI init structures */
#if defined(_SILICON_LABS_32B_SERIES_1)
#define EBI_INIT_DEFAULT                                      \
  {                                                           \
    ebiModeD8A8,    /* 8 bit address, 8 bit data */           \
    ebiActiveLow,   /* ARDY polarity */                       \
    ebiActiveLow,   /* ALE polarity */                        \
    ebiActiveLow,   /* WE polarity */                         \
    ebiActiveLow,   /* RE polarity */                         \
    ebiActiveLow,   /* CS polarity */                         \
    ebiActiveLow,   /* BL polarity */                         \
    false,          /* enable BL */                           \
    false,          /* enable NOIDLE */                       \
    false,          /* enable ARDY */                         \
    false,          /* don't disable ARDY timeout */          \
    EBI_BANK0,      /* enable bank 0 */                       \
    EBI_CS0,        /* enable chip select 0 */                \
    0,              /* addr setup cycles */                   \
    1,              /* addr hold cycles */                    \
    false,          /* do not enable half cycle ALE strobe */ \
    0,              /* read setup cycles */                   \
    0,              /* read strobe cycles */                  \
    0,              /* read hold cycles */                    \
    false,          /* disable page mode */                   \
    false,          /* disable prefetch */                    \
    false,          /* do not enable half cycle REn strobe */ \
    0,              /* write setup cycles */                  \
    0,              /* write strobe cycles */                 \
    1,              /* write hold cycles */                   \
    false,          /* do not disable the write buffer */     \
    false,          /* do not enable halc cycle WEn strobe */ \
    ebiALowA0,      /* ALB - Low bound, address lines */      \
    ebiAHighA0,     /* APEN - High bound, address lines */    \
    true,           /* enable EBI */                          \
  }
#elif !defined(_EFM32_GECKO_FAMILY)
#define EBI_INIT_DEFAULT                                      \
  {                                                           \
    ebiModeD8A8,    /* 8 bit address, 8 bit data */           \
    ebiActiveLow,   /* ARDY polarity */                       \
    ebiActiveLow,   /* ALE polarity */                        \
    ebiActiveLow,   /* WE polarity */                         \
    ebiActiveLow,   /* RE polarity */                         \
    ebiActiveLow,   /* CS polarity */                         \
    ebiActiveLow,   /* BL polarity */                         \
    false,          /* enable BL */                           \
    false,          /* enable NOIDLE */                       \
    false,          /* enable ARDY */                         \
    false,          /* don't disable ARDY timeout */          \
    EBI_BANK0,      /* enable bank 0 */                       \
    EBI_CS0,        /* enable chip select 0 */                \
    0,              /* addr setup cycles */                   \
    1,              /* addr hold cycles */                    \
    false,          /* do not enable half cycle ALE strobe */ \
    0,              /* read setup cycles */                   \
    0,              /* read strobe cycles */                  \
    0,              /* read hold cycles */                    \
    false,          /* disable page mode */                   \
    false,          /* disable prefetch */                    \
    false,          /* do not enable half cycle REn strobe */ \
    0,              /* write setup cycles */                  \
    0,              /* write strobe cycles */                 \
    1,              /* write hold cycles */                   \
    false,          /* do not disable the write buffer */     \
    false,          /* do not enable halc cycle WEn strobe */ \
    ebiALowA0,      /* ALB - Low bound, address lines */      \
    ebiAHighA0,     /* APEN - High bound, address lines */    \
    ebiLocation0,   /* Use Location 0 */                      \
    true,           /* enable EBI */                          \
  }
#else
#define EBI_INIT_DEFAULT                               \
  {                                                    \
    ebiModeD8A8,      /* 8 bit address, 8 bit data */  \
    ebiActiveLow,     /* ARDY polarity */              \
    ebiActiveLow,     /* ALE polarity */               \
    ebiActiveLow,     /* WE polarity */                \
    ebiActiveLow,     /* RE polarity */                \
    ebiActiveLow,     /* CS polarity */                \
    false,            /* enable ARDY */                \
    false,            /* don't disable ARDY timeout */ \
    EBI_BANK0,        /* enable bank 0 */              \
    EBI_CS0,          /* enable chip select 0 */       \
    0,                /* addr setup cycles */          \
    1,                /* addr hold cycles */           \
    0,                /* read setup cycles */          \
    0,                /* read strobe cycles */         \
    0,                /* read hold cycles */           \
    0,                /* write setup cycles */         \
    0,                /* write strobe cycles */        \
    1,                /* write hold cycles */          \
    true,             /* enable EBI */                 \
  }
#endif

