lixpaulian/efr32xx-rail/platform/emlib/inc/em_ebi.h
#if defined(_EBI_TFTCTRL_MASK)

/** TFT Initialization structure */
typedef struct {
  /** External memory bank for driving display */
  EBI_TFTBank_TypeDef            bank;
  /** Width */
  EBI_TFTWidth_TypeDef           width;
  /** Color source for masking and alpha blending */
  EBI_TFTColorSrc_TypeDef        colSrc;
  /** Bus Interleave mode */
  EBI_TFTInterleave_TypeDef      interleave;
  /** Trigger for updating frame buffer pointer */
  EBI_TFTFrameBufTrigger_TypeDef fbTrigger;
  /** Drive DCLK from negative clock edge of internal clock */
  bool                           shiftDClk;
  /** Masking and alpha blending mode */
  EBI_TFTMaskBlend_TypeDef       maskBlend;
  /** TFT Direct Drive mode */
  EBI_TFTDDMode_TypeDef          driveMode;
  /** TFT Polarity for Chip Select (CS) Line */
  EBI_Polarity_TypeDef           csPolarity;
  /** TFT Polarity for Data Clock (DCLK) Line */
  EBI_Polarity_TypeDef           dclkPolarity;
  /** TFT Polarity for Data Enable (DATAEN) Line */
  EBI_Polarity_TypeDef           dataenPolarity;
  /** TFT Polarity for Horizontal Sync (HSYNC) Line */
  EBI_Polarity_TypeDef           hsyncPolarity;
  /** TFT Polarity for Vertical Sync (VSYNC) Line */
  EBI_Polarity_TypeDef           vsyncPolarity;
  /** Horizontal size in pixels */
  int                            hsize;
  /** Horizontal Front Porch Size */
  int                            hPorchFront;
  /** Horizontal Back Porch Size */
  int                            hPorchBack;
  /** Horizontal Synchronization Pulse Width */
  int                            hPulseWidth;
  /** Vertical size in pixels */
  int                            vsize;
  /** Vertical Front Porch Size */
  int                            vPorchFront;
  /** Vertical Back Porch Size */
  int                            vPorchBack;
  /** Vertical Synchronization Pulse Width */
  int                            vPulseWidth;
  /** TFT Frame Buffer address, offset to EBI bank base address */
  uint32_t                       addressOffset;
  /** TFT DCLK period in internal cycles */
  int                            dclkPeriod;
  /** Starting position of External Direct Drive relative to DCLK inactive edge */
  int                            startPosition;
  /** Number of cycles RGB data is driven before active edge of DCLK */
  int                            setupCycles;
  /** Number of cycles RGB data is held after active edge of DCLK */
  int                            holdCycles;
} EBI_TFTInit_TypeDef;

/** Default configuration for EBI TFT init structure */
#define EBI_TFTINIT_DEFAULT                                                         \
  {                                                                                 \
    ebiTFTBank0,              /* Select EBI Bank 0 */                               \
    ebiTFTWidthHalfWord,      /* Select 2-byte increments */                        \
    ebiTFTColorSrcMem,        /* Use memory as source for mask/blending */          \
    ebiTFTInterleaveUnlimited, /* Unlimited interleaved accesses */                 \
    ebiTFTFrameBufTriggerVSync, /* VSYNC as frame buffer update trigger */          \
    false,                    /* Drive DCLK from negative edge of internal clock */ \
    ebiTFTMBDisabled,         /* No masking and alpha blending enabled */           \
    ebiTFTDDModeExternal,     /* Drive from external memory */                      \
    ebiActiveLow,             /* CS Active Low polarity */                          \
    ebiActiveLow,             /* DCLK Active Low polarity */                        \
    ebiActiveLow,             /* DATAEN Active Low polarity */                      \
    ebiActiveLow,             /* HSYNC Active Low polarity */                       \
    ebiActiveLow,             /* VSYNC Active Low polarity */                       \
    320,                      /* Horizontal size in pixels */                       \
    1,                        /* Horizontal Front Porch */                          \
    29,                       /* Horizontal Back Porch */                           \
    2,                        /* Horizontal Synchronization Pulse Width */          \
    240,                      /* Vertical size in pixels */                         \
    1,                        /* Vertical Front Porch */                            \
    4,                        /* Vertical Back Porch */                             \
    2,                        /* Vertical Synchronization Pulse Width */            \
    0x0000,                   /* Address offset to EBI memory base */               \
    5,                        /* DCLK Period */                                     \
    2,                        /* DCLK Start */                                      \
    1,                        /* DCLK Setup cycles */                               \
    1,                        /* DCLK Hold cycles */                                \
  }
#endif

/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/

void EBI_Init(const EBI_Init_TypeDef *ebiInit);
void EBI_Disable(void);
uint32_t EBI_BankAddress(uint32_t bank);
void EBI_BankEnable(uint32_t banks, bool enable);

#if defined(_EBI_TFTCTRL_MASK)
void EBI_TFTInit(const EBI_TFTInit_TypeDef *ebiTFTInit);
void EBI_TFTSizeSet(uint32_t horizontal, uint32_t vertical);
void EBI_TFTHPorchSet(int front, int back, int pulseWidth);
void EBI_TFTVPorchSet(int front, int back, int pulseWidth);
void EBI_TFTTimingSet(int dclkPeriod, int start, int setup, int hold);
#endif

#if !defined(_EFM32_GECKO_FAMILY)
/* This functionality is only available on devices with independent timing support */
void EBI_BankReadTimingSet(uint32_t bank, int setupCycles, int strobeCycles, int holdCycles);
void EBI_BankReadTimingConfig(uint32_t bank, bool pageMode, bool prefetch, bool halfRE);

void EBI_BankWriteTimingSet(uint32_t bank, int setupCycles, int strobeCycles, int holdCycles);
void EBI_BankWriteTimingConfig(uint32_t bank, bool writeBufDisable, bool halfWE);

